-- Добавление ферм
INSERT INTO farms (name, location, owner) VALUES
('GreenField', 'Ташкентская область', 'Ахмадов И.'),
('AgroPlus', 'Самаркандская область', 'Каримов Р.'),
('EcoFarm', 'Бухарская область', 'Юсупов Н.');

-- Добавление культур
INSERT INTO crops (name, type, growing_season) VALUES
('Пшеница', 'Зерновая', 'Весна-лето'),
('Хлопок', 'Техническая', 'Лето-осень'),
('Кукуруза', 'Кормовая', 'Весна-лето'),
('Рис', 'Зерновая', 'Лето');

-- Добавление типов почв
INSERT INTO soils (type, ph_level, fertility) VALUES
('Суглинистая', 6.8, 'Высокая'),
('Песчаная', 7.2, 'Средняя'),
('Глинистая', 6.0, 'Низкая'),
('Чернозем', 7.0, 'Очень высокая');

-- Добавление данных по урожайности
INSERT INTO yields (farm_id, crop_id, soil_id, harvest_year, yield_amount) VALUES
(1, 1, 4, 2024, 4000.5),
(1, 2, 1, 2024, 2500.0),
(2, 3, 2, 2023, 3800.7),
(3, 4, 4, 2024, 5200.2),
(2, 1, 3, 2024, 3000.0);
